IDEA StatiCa Open Model
ExposureClassesDataEc2.NoCorrosionCheck Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Check box No corrosion
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool NoCorrosionCheck { get; set; }
Public Property NoCorrosionCheck As Boolean
	Get
	Set
public:
property bool NoCorrosionCheck {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ExposureClassesDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace